{
  "special": [
    "<beatmap_start>",
    "<beatmap_end>",
    "<hit_object_start>",
    "<hit_object_end>"
  ],
  "type": [
    "type_circle",
    "type_slider",
    "type_spinner"
  ],
  "x": [
    "x_0",
    "x_32",
    "x_64",
    "x_96",
    "x_128",
    "x_160",
    "x_192",
    "x_224",
    "x_256",
    "x_288",
    "x_320",
    "x_352",
    "x_384",
    "x_416",
    "x_448",
    "x_480",
    "x_512"
  ],
  "y": [
    "y_0",
    "y_32",
    "y_64",
    "y_96",
    "y_128",
    "y_160",
    "y_192",
    "y_224",
    "y_256",
    "y_288",
    "y_320",
    "y_352",
    "y_384"
  ],
  "hit_sound": [
    "hit_sound_0",
    "hit_sound_2",
    "hit_sound_4",
    "hit_sound_6",
    "hit_sound_8",
    "hit_sound_10",
    "hit_sound_12",
    "hit_sound_14"
  ],
  "path": [
    "<start_path>",
    "<end_path>",
    "B",
    "L",
    "P",
    "C"
  ],
  "repeat": [
    "repeat_0",
    "repeat_1",
    "repeat_2",
    "repeat_3",
    "repeat_4",
    "repeat_5",
    "repeat_6",
    "repeat_7",
    "repeat_8",
    "repeat_9",
    "repeat_10",
    "repeat_11",
    "repeat_12",
    "repeat_13",
    "repeat_14",
    "repeat_15",
    "repeat_16",
    "repeat_17",
    "repeat_18",
    "repeat_19",
    "repeat_20",
    "repeat_21",
    "repeat_22",
    "repeat_23",
    "repeat_24",
    "repeat_25",
    "repeat_26",
    "repeat_27",
    "repeat_28",
    "repeat_29",
    "repeat_30",
    "<start_repeat>",
    "<end_repeat>"
  ],
  "new_combo": [
    "new_combo_0",
    "new_combo_1"
  ],
  "slider_velocity": [
    "sv_0.0",
    "sv_0.1",
    "sv_0.2",
    "sv_0.3",
    "sv_0.4",
    "sv_0.5",
    "sv_0.6",
    "sv_0.7",
    "sv_0.8",
    "sv_0.9",
    "sv_1.0",
    "sv_1.1",
    "sv_1.2",
    "sv_1.3",
    "sv_1.4",
    "sv_1.5",
    "sv_1.6",
    "sv_1.7",
    "sv_1.8",
    "sv_1.9",
    "sv_2.0",
    "sv_2.1",
    "sv_2.2",
    "sv_2.3",
    "sv_2.4",
    "sv_2.5",
    "sv_2.6",
    "sv_2.7",
    "sv_2.8",
    "sv_2.9",
    "sv_3.0",
    "sv_3.1",
    "sv_3.2",
    "sv_3.3",
    "sv_3.4",
    "sv_3.5",
    "sv_3.6",
    "sv_3.7",
    "sv_3.8",
    "sv_3.9",
    "sv_4.0",
    "sv_4.1",
    "sv_4.2",
    "sv_4.3",
    "sv_4.4",
    "sv_4.5",
    "sv_4.6",
    "sv_4.7",
    "sv_4.8",
    "sv_4.9",
    "sv_5.0",
    "sv_5.1",
    "sv_5.2",
    "sv_5.3",
    "sv_5.4",
    "sv_5.5",
    "sv_5.6",
    "sv_5.7",
    "sv_5.8",
    "sv_5.9",
    "sv_6.0",
    "sv_6.1",
    "sv_6.2",
    "sv_6.3",
    "sv_6.4",
    "sv_6.5",
    "sv_6.6",
    "sv_6.7",
    "sv_6.8",
    "sv_6.9",
    "sv_7.0",
    "sv_7.1",
    "sv_7.2",
    "sv_7.3",
    "sv_7.4",
    "sv_7.5",
    "sv_7.6",
    "sv_7.7",
    "sv_7.8",
    "sv_7.9",
    "sv_8.0",
    "sv_8.1",
    "sv_8.2",
    "sv_8.3",
    "sv_8.4",
    "sv_8.5",
    "sv_8.6",
    "sv_8.7",
    "sv_8.8",
    "sv_8.9",
    "sv_9.0",
    "sv_9.1",
    "sv_9.2",
    "sv_9.3",
    "sv_9.4",
    "sv_9.5",
    "sv_9.6",
    "sv_9.7",
    "sv_9.8",
    "sv_9.9",
    "sv_10.0",
    "sv_10.1",
    "sv_10.2",
    "sv_10.3",
    "sv_10.4",
    "sv_10.5",
    "sv_10.6",
    "sv_10.7",
    "sv_10.8",
    "sv_10.9",
    "sv_11.0",
    "sv_11.1",
    "sv_11.2",
    "sv_11.3",
    "sv_11.4",
    "sv_11.5",
    "sv_11.6",
    "sv_11.7",
    "sv_11.8",
    "sv_11.9",
    "sv_12.0",
    "sv_12.1",
    "sv_12.2",
    "sv_12.3",
    "sv_12.4",
    "sv_12.5",
    "sv_12.6",
    "sv_12.7",
    "sv_12.8",
    "sv_12.9",
    "sv_13.0",
    "sv_13.1",
    "sv_13.2",
    "sv_13.3",
    "sv_13.4",
    "sv_13.5",
    "sv_13.6",
    "sv_13.7",
    "sv_13.8",
    "sv_13.9",
    "sv_14.0",
    "sv_14.1",
    "sv_14.2",
    "sv_14.3",
    "sv_14.4",
    "sv_14.5",
    "sv_14.6",
    "sv_14.7",
    "sv_14.8",
    "sv_14.9",
    "sv_15.0",
    "sv_15.1",
    "sv_15.2",
    "sv_15.3",
    "sv_15.4",
    "sv_15.5",
    "sv_15.6",
    "sv_15.7",
    "sv_15.8",
    "sv_15.9",
    "sv_16.0",
    "sv_16.1",
    "sv_16.2",
    "sv_16.3",
    "sv_16.4",
    "sv_16.5",
    "sv_16.6",
    "sv_16.7",
    "sv_16.8",
    "sv_16.9",
    "sv_17.0",
    "sv_17.1",
    "sv_17.2",
    "sv_17.3",
    "sv_17.4",
    "sv_17.5",
    "sv_17.6",
    "sv_17.7",
    "sv_17.8",
    "sv_17.9",
    "sv_18.0",
    "sv_18.1",
    "sv_18.2",
    "sv_18.3",
    "sv_18.4",
    "sv_18.5",
    "sv_18.6",
    "sv_18.7",
    "sv_18.8",
    "sv_18.9",
    "sv_19.0",
    "sv_19.1",
    "sv_19.2",
    "sv_19.3",
    "sv_19.4",
    "sv_19.5",
    "sv_19.6",
    "sv_19.7",
    "sv_19.8",
    "sv_19.9",
    "sv_20.0",
    "sv_20.1",
    "sv_20.2",
    "sv_20.3",
    "sv_20.4",
    "sv_20.5",
    "sv_20.6",
    "sv_20.7",
    "sv_20.8",
    "sv_20.9",
    "sv_21.0",
    "sv_21.1",
    "sv_21.2",
    "sv_21.3",
    "sv_21.4",
    "sv_21.5",
    "sv_21.6",
    "sv_21.7",
    "sv_21.8",
    "sv_21.9",
    "sv_22.0",
    "sv_22.1",
    "sv_22.2",
    "sv_22.3",
    "sv_22.4",
    "sv_22.5",
    "sv_22.6",
    "sv_22.7",
    "sv_22.8",
    "sv_22.9",
    "sv_23.0",
    "sv_23.1",
    "sv_23.2",
    "sv_23.3",
    "sv_23.4",
    "sv_23.5",
    "sv_23.6",
    "sv_23.7",
    "sv_23.8",
    "sv_23.9",
    "sv_24.0",
    "sv_24.1",
    "sv_24.2",
    "sv_24.3",
    "sv_24.4",
    "sv_24.5",
    "sv_24.6",
    "sv_24.7",
    "sv_24.8",
    "sv_24.9",
    "sv_25.0",
    "sv_25.1",
    "sv_25.2",
    "sv_25.3",
    "sv_25.4",
    "sv_25.5",
    "sv_25.6",
    "sv_25.7",
    "sv_25.8",
    "sv_25.9",
    "sv_26.0",
    "sv_26.1",
    "sv_26.2",
    "sv_26.3",
    "sv_26.4",
    "sv_26.5",
    "sv_26.6",
    "sv_26.7",
    "sv_26.8",
    "sv_26.9",
    "sv_27.0",
    "sv_27.1",
    "sv_27.2",
    "sv_27.3",
    "sv_27.4",
    "sv_27.5",
    "sv_27.6",
    "sv_27.7",
    "sv_27.8",
    "sv_27.9",
    "sv_28.0",
    "sv_28.1",
    "sv_28.2",
    "sv_28.3",
    "sv_28.4",
    "sv_28.5",
    "sv_28.6",
    "sv_28.7",
    "sv_28.8",
    "sv_28.9",
    "sv_29.0",
    "sv_29.1",
    "sv_29.2",
    "sv_29.3",
    "sv_29.4",
    "sv_29.5",
    "sv_29.6",
    "sv_29.7",
    "sv_29.8",
    "sv_29.9",
    "sv_30.0",
    "sv_30.1",
    "sv_30.2",
    "sv_30.3",
    "sv_30.4",
    "sv_30.5",
    "sv_30.6",
    "sv_30.7",
    "sv_30.8",
    "sv_30.9",
    "sv_31.0",
    "sv_31.1",
    "sv_31.2",
    "sv_31.3",
    "sv_31.4",
    "sv_31.5",
    "sv_31.6",
    "sv_31.7",
    "sv_31.8",
    "sv_31.9",
    "sv_32.0",
    "sv_32.1",
    "sv_32.2",
    "sv_32.3",
    "sv_32.4",
    "sv_32.5",
    "sv_32.6",
    "sv_32.7",
    "sv_32.8",
    "sv_32.9",
    "sv_33.0",
    "sv_33.1",
    "sv_33.2",
    "sv_33.3",
    "sv_33.4",
    "sv_33.5",
    "sv_33.6",
    "sv_33.7",
    "sv_33.8",
    "sv_33.9",
    "sv_34.0",
    "sv_34.1",
    "sv_34.2",
    "sv_34.3",
    "sv_34.4",
    "sv_34.5",
    "sv_34.6",
    "sv_34.7",
    "sv_34.8",
    "sv_34.9",
    "sv_35.0",
    "sv_35.1",
    "sv_35.2",
    "sv_35.3",
    "sv_35.4",
    "sv_35.5",
    "sv_35.6",
    "sv_35.7",
    "sv_35.8",
    "sv_35.9",
    "sv_36.0",
    "sv_36.1",
    "sv_36.2",
    "sv_36.3",
    "sv_36.4",
    "sv_36.5",
    "sv_36.6",
    "sv_36.7",
    "sv_36.8",
    "sv_36.9"
  ],
  "sample_set": [
    "sample_set_0",
    "sample_set_1",
    "sample_set_2",
    "sample_set_3"
  ],
  "volume": [
    "vol_0",
    "vol_10",
    "vol_20",
    "vol_30",
    "vol_40",
    "vol_50",
    "vol_60",
    "vol_70",
    "vol_80",
    "vol_90",
    "vol_100"
  ],
  "effects": [
    "effects_0",
    "effects_1"
  ],
  "duration": [
    "duration_0",
    "duration_1",
    "duration_2",
    "duration_3",
    "duration_4",
    "duration_5",
    "duration_6",
    "duration_7",
    "duration_8",
    "duration_9",
    "duration_10",
    "duration_11",
    "duration_12",
    "duration_13",
    "duration_14",
    "duration_15",
    "duration_16",
    "duration_17",
    "duration_18",
    "duration_19",
    "duration_20",
    "duration_21",
    "duration_22",
    "duration_23",
    "duration_24",
    "duration_25",
    "duration_26",
    "duration_27",
    "duration_28",
    "duration_29",
    "duration_30",
    "duration_31",
    "duration_32",
    "duration_33",
    "duration_34",
    "duration_35",
    "duration_36",
    "duration_37",
    "duration_38",
    "duration_39",
    "duration_40",
    "duration_41",
    "duration_42",
    "duration_43",
    "duration_44",
    "duration_45",
    "duration_46",
    "duration_47",
    "duration_48",
    "duration_49",
    "duration_50",
    "duration_51",
    "duration_52",
    "duration_53",
    "duration_54",
    "duration_55",
    "duration_56",
    "duration_57",
    "duration_58",
    "duration_59",
    "duration_60",
    "duration_61",
    "duration_62",
    "duration_63",
    "duration_64",
    "duration_65",
    "duration_66",
    "duration_67",
    "duration_68",
    "duration_69",
    "duration_70",
    "duration_71",
    "duration_72",
    "duration_73",
    "duration_74",
    "duration_75",
    "duration_76",
    "duration_77",
    "duration_78",
    "duration_79",
    "duration_80",
    "duration_81",
    "duration_82",
    "duration_83",
    "duration_84",
    "duration_85",
    "duration_86",
    "duration_87",
    "duration_88",
    "duration_89",
    "duration_90",
    "duration_91",
    "duration_92",
    "duration_93",
    "duration_94",
    "duration_95",
    "duration_96",
    "duration_97",
    "duration_98",
    "duration_99",
    "duration_100",
    "duration_101",
    "duration_102",
    "duration_103",
    "duration_104",
    "duration_105",
    "duration_106",
    "duration_107",
    "duration_108",
    "duration_109",
    "duration_110",
    "duration_111",
    "duration_112",
    "duration_113",
    "duration_114",
    "duration_115",
    "duration_116",
    "duration_117",
    "duration_118",
    "duration_119",
    "duration_120",
    "duration_121",
    "duration_122",
    "duration_123",
    "duration_124",
    "duration_125",
    "duration_126",
    "duration_127",
    "duration_128",
    "duration_129",
    "duration_130",
    "duration_131",
    "duration_132",
    "duration_133",
    "duration_134",
    "duration_135",
    "duration_136",
    "duration_137",
    "duration_138",
    "duration_139",
    "duration_140",
    "duration_141",
    "duration_142",
    "duration_143",
    "duration_144",
    "duration_145",
    "duration_146",
    "duration_147",
    "duration_148",
    "duration_149",
    "duration_150",
    "duration_151",
    "duration_152",
    "duration_153",
    "duration_154",
    "duration_155",
    "duration_156",
    "duration_157",
    "duration_158",
    "duration_159",
    "duration_160",
    "duration_161",
    "duration_162",
    "duration_163",
    "duration_164",
    "duration_165",
    "duration_166",
    "duration_167",
    "duration_168",
    "duration_169",
    "duration_170",
    "duration_171",
    "duration_172",
    "duration_173",
    "duration_174",
    "duration_175",
    "duration_176",
    "duration_177",
    "duration_178",
    "duration_179",
    "duration_180",
    "duration_181",
    "duration_182",
    "duration_183",
    "duration_184",
    "duration_185",
    "duration_186",
    "duration_187",
    "duration_188",
    "duration_189",
    "duration_190",
    "duration_191",
    "duration_192",
    "duration_193",
    "duration_194",
    "duration_195",
    "duration_196",
    "duration_197",
    "duration_198",
    "duration_199",
    "duration_200",
    "duration_201",
    "duration_202",
    "duration_203",
    "duration_204",
    "duration_205",
    "duration_206",
    "duration_207",
    "duration_208",
    "duration_209",
    "duration_210",
    "duration_211",
    "duration_212",
    "duration_213",
    "duration_214",
    "duration_215",
    "duration_216",
    "duration_217",
    "duration_218",
    "duration_219",
    "duration_220",
    "duration_221",
    "duration_222",
    "duration_223",
    "duration_224",
    "duration_225",
    "duration_226",
    "duration_227",
    "duration_228",
    "duration_229",
    "duration_230",
    "duration_231",
    "duration_232",
    "duration_233",
    "duration_234",
    "duration_235",
    "duration_236",
    "duration_237",
    "duration_238",
    "duration_239",
    "duration_240",
    "duration_241",
    "duration_242",
    "duration_243",
    "duration_244",
    "duration_245",
    "duration_246",
    "duration_247",
    "duration_248",
    "duration_249",
    "duration_250",
    "duration_251",
    "duration_252",
    "duration_253",
    "duration_254",
    "duration_255",
    "duration_256",
    "duration_257",
    "duration_258",
    "duration_259",
    "duration_260",
    "duration_261",
    "duration_262",
    "duration_263",
    "duration_264",
    "duration_265",
    "duration_266",
    "duration_267",
    "duration_268",
    "duration_269",
    "duration_270",
    "duration_271",
    "duration_272",
    "duration_273",
    "duration_274",
    "duration_275",
    "duration_276",
    "duration_277",
    "duration_278",
    "duration_279",
    "duration_280",
    "duration_281",
    "duration_282",
    "duration_283",
    "duration_284",
    "duration_285",
    "duration_286",
    "duration_287",
    "duration_288",
    "duration_289",
    "duration_290",
    "duration_291",
    "duration_292",
    "duration_293",
    "duration_294",
    "duration_295",
    "duration_296",
    "duration_297",
    "duration_298",
    "duration_299",
    "duration_300",
    "duration_301",
    "duration_302",
    "duration_303",
    "duration_304",
    "duration_305",
    "duration_306",
    "duration_307",
    "duration_308",
    "duration_309",
    "duration_310",
    "duration_311",
    "duration_312",
    "duration_313",
    "duration_314",
    "duration_315",
    "duration_316",
    "duration_317",
    "duration_318",
    "duration_319",
    "duration_320",
    "duration_321",
    "duration_322",
    "duration_323",
    "duration_324",
    "duration_325",
    "duration_326",
    "duration_327",
    "duration_328",
    "duration_329",
    "duration_330",
    "duration_331",
    "duration_332",
    "duration_333",
    "duration_334",
    "duration_335",
    "duration_336",
    "duration_337",
    "duration_338",
    "duration_339",
    "duration_340",
    "duration_341",
    "duration_342",
    "duration_343",
    "duration_344",
    "duration_345",
    "duration_346",
    "duration_347",
    "duration_348",
    "duration_349",
    "duration_350",
    "duration_351",
    "duration_352",
    "duration_353",
    "duration_354",
    "duration_355",
    "duration_356",
    "duration_357",
    "duration_358",
    "duration_359",
    "duration_360",
    "duration_361",
    "duration_362",
    "duration_363",
    "duration_364",
    "duration_365",
    "duration_366",
    "duration_367",
    "duration_368",
    "duration_369",
    "duration_370",
    "duration_371",
    "duration_372",
    "duration_373",
    "duration_374",
    "duration_375",
    "duration_376",
    "duration_377",
    "duration_378",
    "duration_379",
    "duration_380",
    "duration_381",
    "duration_382",
    "duration_383",
    "duration_384",
    "duration_385",
    "duration_386",
    "duration_387",
    "duration_388",
    "duration_389",
    "duration_390",
    "duration_391",
    "duration_392",
    "duration_393",
    "duration_394",
    "duration_395",
    "duration_396",
    "duration_397",
    "duration_398",
    "duration_399",
    "duration_400",
    "duration_401",
    "duration_402",
    "duration_403",
    "duration_404",
    "duration_405",
    "duration_406",
    "duration_407",
    "duration_408",
    "duration_409",
    "duration_410",
    "duration_411",
    "duration_412",
    "duration_413",
    "duration_414",
    "duration_415",
    "duration_416",
    "duration_417",
    "duration_418",
    "duration_419",
    "duration_420",
    "duration_421",
    "duration_422",
    "duration_423",
    "duration_424",
    "duration_425",
    "duration_426",
    "duration_427",
    "duration_428",
    "duration_429",
    "duration_430",
    "duration_431",
    "duration_432",
    "duration_433",
    "duration_434",
    "duration_435",
    "duration_436",
    "duration_437",
    "duration_438",
    "duration_439",
    "duration_440",
    "duration_441",
    "duration_442",
    "duration_443",
    "duration_444",
    "duration_445",
    "duration_446",
    "duration_447",
    "duration_448",
    "duration_449",
    "duration_450",
    "duration_451",
    "duration_452",
    "duration_453",
    "duration_454",
    "duration_455",
    "duration_456",
    "duration_457",
    "duration_458",
    "duration_459",
    "duration_460",
    "duration_461",
    "duration_462",
    "duration_463",
    "duration_464",
    "duration_465",
    "duration_466",
    "duration_467",
    "duration_468",
    "duration_469",
    "duration_470",
    "duration_471",
    "duration_472",
    "duration_473",
    "duration_474",
    "duration_475",
    "duration_476",
    "duration_477",
    "duration_478",
    "duration_479",
    "duration_480",
    "duration_481",
    "duration_482",
    "duration_483",
    "duration_484",
    "duration_485",
    "duration_486",
    "duration_487",
    "duration_488",
    "duration_489",
    "duration_490",
    "duration_491",
    "duration_492",
    "duration_493",
    "duration_494",
    "duration_495",
    "duration_496",
    "duration_497",
    "duration_498",
    "duration_499",
    "duration_500",
    "duration_501",
    "duration_502",
    "duration_503",
    "duration_504",
    "duration_505",
    "duration_506",
    "duration_507",
    "duration_508",
    "duration_509",
    "duration_510",
    "duration_511",
    "duration_512",
    "duration_513",
    "duration_514",
    "duration_515",
    "duration_516",
    "duration_517",
    "duration_518",
    "duration_519",
    "duration_520",
    "duration_521",
    "duration_522",
    "duration_523",
    "duration_524",
    "duration_525",
    "duration_526",
    "duration_527",
    "duration_528",
    "duration_529",
    "duration_530",
    "duration_531",
    "duration_532",
    "duration_533",
    "duration_534",
    "duration_535",
    "duration_536",
    "duration_537",
    "duration_538",
    "duration_539",
    "duration_540",
    "duration_541",
    "duration_542",
    "duration_543",
    "duration_544",
    "duration_545",
    "duration_546",
    "duration_547",
    "duration_548",
    "duration_549",
    "duration_550",
    "duration_551",
    "duration_552",
    "duration_553",
    "duration_554",
    "duration_555",
    "duration_556",
    "duration_557",
    "duration_558",
    "duration_559",
    "duration_560",
    "duration_561",
    "duration_562",
    "duration_563",
    "duration_564",
    "duration_565",
    "duration_566",
    "duration_567",
    "duration_568",
    "duration_569",
    "duration_570",
    "duration_571",
    "duration_572",
    "duration_573",
    "duration_574",
    "duration_575",
    "duration_576",
    "duration_577",
    "duration_578",
    "duration_579",
    "duration_580",
    "duration_581",
    "duration_582",
    "duration_583",
    "duration_584",
    "duration_585",
    "duration_586",
    "duration_587",
    "duration_588",
    "duration_589",
    "duration_590",
    "duration_591",
    "duration_592",
    "duration_593",
    "duration_594",
    "duration_595",
    "duration_596",
    "duration_597",
    "duration_598",
    "duration_599",
    "duration_600",
    "duration_601",
    "duration_602",
    "duration_603",
    "duration_604",
    "duration_605",
    "duration_606",
    "duration_607",
    "duration_608",
    "duration_609",
    "duration_610",
    "duration_611",
    "duration_612",
    "duration_613",
    "duration_614",
    "duration_615",
    "duration_616",
    "duration_617",
    "duration_618",
    "duration_619",
    "duration_620",
    "duration_621",
    "duration_622",
    "duration_623",
    "duration_624",
    "duration_625",
    "duration_626",
    "duration_627",
    "duration_628",
    "duration_629",
    "duration_630",
    "duration_631",
    "duration_632",
    "duration_633",
    "duration_634",
    "duration_635",
    "duration_636",
    "duration_637",
    "duration_638",
    "duration_639",
    "duration_640",
    "duration_641",
    "duration_642",
    "duration_643",
    "duration_644",
    "duration_645",
    "duration_646",
    "duration_647",
    "duration_648",
    "duration_649",
    "duration_650",
    "duration_651",
    "duration_652",
    "duration_653",
    "duration_654",
    "duration_655",
    "duration_656",
    "duration_657",
    "duration_658",
    "duration_659",
    "duration_660",
    "duration_661",
    "duration_662",
    "duration_663",
    "duration_664",
    "duration_665",
    "duration_666",
    "duration_667",
    "duration_668",
    "duration_669",
    "duration_670",
    "duration_671",
    "duration_672",
    "duration_673",
    "duration_674",
    "duration_675",
    "duration_676",
    "duration_677",
    "duration_678",
    "duration_679",
    "duration_680",
    "duration_681",
    "duration_682",
    "duration_683",
    "duration_684",
    "duration_685",
    "duration_686",
    "duration_687",
    "duration_688",
    "duration_689",
    "duration_690",
    "duration_691",
    "duration_692",
    "duration_693",
    "duration_694",
    "duration_695",
    "duration_696",
    "duration_697",
    "duration_698",
    "duration_699",
    "duration_700",
    "duration_701",
    "duration_702",
    "duration_703",
    "duration_704",
    "duration_705",
    "duration_706",
    "duration_707",
    "duration_708",
    "duration_709",
    "duration_710",
    "duration_711",
    "duration_712",
    "duration_713",
    "duration_714",
    "duration_715",
    "duration_716",
    "duration_717",
    "duration_718",
    "duration_719",
    "duration_720",
    "duration_721",
    "duration_722",
    "duration_723",
    "duration_724",
    "duration_725",
    "duration_726",
    "duration_727",
    "duration_728",
    "duration_729",
    "duration_730",
    "duration_731",
    "duration_732",
    "duration_733",
    "duration_734",
    "duration_735",
    "duration_736",
    "duration_737",
    "duration_738",
    "duration_739",
    "duration_740",
    "duration_741",
    "duration_742",
    "duration_743",
    "duration_744",
    "duration_745",
    "duration_746",
    "duration_747",
    "duration_748",
    "duration_749",
    "duration_750",
    "duration_751",
    "duration_752",
    "duration_753",
    "duration_754",
    "duration_755",
    "duration_756",
    "duration_757",
    "duration_758",
    "duration_759",
    "duration_760",
    "duration_761",
    "duration_762",
    "duration_763",
    "duration_764",
    "duration_765",
    "duration_766",
    "duration_767",
    "duration_768",
    "duration_769",
    "duration_770",
    "duration_771",
    "duration_772",
    "duration_773",
    "duration_774",
    "duration_775",
    "duration_776",
    "duration_777",
    "duration_778",
    "duration_779",
    "duration_780",
    "duration_781",
    "duration_782",
    "duration_783",
    "duration_784",
    "duration_785",
    "duration_786",
    "duration_787",
    "duration_788",
    "duration_789",
    "duration_790",
    "duration_791",
    "duration_792",
    "duration_793",
    "duration_794",
    "duration_795",
    "duration_796",
    "duration_797",
    "duration_798",
    "duration_799",
    "duration_800",
    "duration_801",
    "duration_802",
    "duration_803",
    "duration_804",
    "duration_805",
    "duration_806",
    "duration_807",
    "duration_808",
    "duration_809",
    "duration_810",
    "duration_811",
    "duration_812",
    "duration_813",
    "duration_814",
    "duration_815",
    "duration_816",
    "duration_817",
    "duration_818",
    "duration_819",
    "duration_820",
    "duration_821",
    "duration_822",
    "duration_823",
    "duration_824",
    "duration_825",
    "duration_826",
    "duration_827",
    "duration_828",
    "duration_829",
    "duration_830",
    "duration_831",
    "duration_832",
    "duration_833",
    "duration_834",
    "duration_835",
    "duration_836",
    "duration_837",
    "duration_838",
    "duration_839",
    "duration_840",
    "duration_841",
    "duration_842",
    "duration_843",
    "duration_844",
    "duration_845",
    "duration_846",
    "duration_847",
    "duration_848",
    "duration_849",
    "duration_850",
    "duration_851",
    "duration_852",
    "duration_853",
    "duration_854",
    "duration_855",
    "duration_856",
    "duration_857",
    "duration_858",
    "duration_859",
    "duration_860",
    "duration_861",
    "duration_862",
    "duration_863",
    "duration_864",
    "duration_865",
    "duration_866",
    "duration_867",
    "duration_868",
    "duration_869",
    "duration_870",
    "duration_871",
    "duration_872",
    "duration_873",
    "duration_874",
    "duration_875",
    "duration_876",
    "duration_877",
    "duration_878",
    "duration_879",
    "duration_880",
    "duration_881",
    "duration_882",
    "duration_883",
    "duration_884",
    "duration_885",
    "duration_886",
    "duration_887",
    "duration_888",
    "duration_889",
    "duration_890",
    "duration_891",
    "duration_892",
    "duration_893",
    "duration_894",
    "duration_895",
    "duration_896",
    "duration_897",
    "duration_898",
    "duration_899",
    "duration_900",
    "duration_901",
    "duration_902",
    "duration_903",
    "duration_904",
    "duration_905",
    "duration_906",
    "duration_907",
    "duration_908",
    "duration_909",
    "duration_910",
    "duration_911",
    "duration_912",
    "duration_913",
    "duration_914",
    "duration_915",
    "duration_916",
    "duration_917",
    "duration_918",
    "duration_919",
    "duration_920",
    "duration_921",
    "duration_922",
    "duration_923",
    "duration_924",
    "duration_925",
    "duration_926",
    "duration_927",
    "duration_928",
    "duration_929",
    "duration_930",
    "duration_931",
    "duration_932",
    "duration_933",
    "duration_934",
    "duration_935",
    "duration_936",
    "duration_937",
    "duration_938",
    "duration_939",
    "duration_940",
    "duration_941",
    "duration_942",
    "duration_943",
    "duration_944",
    "duration_945",
    "duration_946",
    "duration_947",
    "duration_948",
    "duration_949",
    "duration_950",
    "duration_951",
    "duration_952",
    "duration_953",
    "duration_954",
    "duration_955",
    "duration_956",
    "duration_957",
    "duration_958",
    "duration_959",
    "duration_960",
    "duration_961",
    "duration_962",
    "duration_963",
    "duration_964",
    "duration_965",
    "duration_966",
    "duration_967",
    "duration_968",
    "duration_969",
    "duration_970",
    "duration_971",
    "duration_972",
    "duration_973",
    "duration_974",
    "duration_975",
    "duration_976",
    "duration_977",
    "duration_978",
    "duration_979",
    "duration_980",
    "duration_981",
    "duration_982",
    "duration_983",
    "duration_984",
    "duration_985",
    "duration_986",
    "duration_987",
    "duration_988",
    "duration_989",
    "duration_990",
    "duration_991",
    "duration_992",
    "duration_993",
    "duration_994",
    "duration_995",
    "duration_996",
    "duration_997",
    "duration_998",
    "duration_999",
    "duration_1000",
    "duration_1001",
    "duration_1002",
    "duration_1003",
    "duration_1004",
    "duration_1005",
    "duration_1006",
    "duration_1007",
    "duration_1008",
    "duration_1009",
    "duration_1010",
    "duration_1011",
    "duration_1012",
    "duration_1013",
    "duration_1014",
    "duration_1015",
    "duration_1016",
    "duration_1017",
    "duration_1018",
    "duration_1019",
    "duration_1020",
    "duration_1021",
    "duration_1022",
    "duration_1023",
    "duration_1024",
    "duration_1025",
    "duration_1026",
    "duration_1027",
    "duration_1028",
    "duration_1029",
    "duration_1030",
    "duration_1031",
    "duration_1032",
    "duration_1033",
    "duration_1034",
    "duration_1035",
    "duration_1036",
    "duration_1037",
    "duration_1038",
    "duration_1039",
    "duration_1040",
    "duration_1041",
    "duration_1042",
    "duration_1043",
    "duration_1044",
    "duration_1045",
    "duration_1046",
    "duration_1047",
    "duration_1048",
    "duration_1049",
    "duration_1050",
    "duration_1051",
    "duration_1052",
    "duration_1053",
    "duration_1054",
    "duration_1055",
    "duration_1056",
    "duration_1057",
    "duration_1058",
    "duration_1059",
    "duration_1060",
    "duration_1061",
    "duration_1062",
    "duration_1063",
    "duration_1064",
    "duration_1065",
    "duration_1066",
    "duration_1067",
    "duration_1068",
    "duration_1069",
    "duration_1070",
    "duration_1071",
    "duration_1072",
    "duration_1073",
    "duration_1074",
    "duration_1075",
    "duration_1076",
    "duration_1077",
    "duration_1078",
    "duration_1079",
    "duration_1080",
    "duration_1081",
    "duration_1082",
    "duration_1083",
    "duration_1084",
    "duration_1085",
    "duration_1086",
    "duration_1087",
    "duration_1088",
    "duration_1089",
    "duration_1090",
    "duration_1091",
    "duration_1092",
    "duration_1093",
    "duration_1094",
    "duration_1095",
    "duration_1096",
    "duration_1097",
    "duration_1098",
    "duration_1099",
    "duration_1100",
    "duration_1101",
    "duration_1102",
    "duration_1103",
    "duration_1104",
    "duration_1105",
    "duration_1106",
    "duration_1107",
    "duration_1108",
    "duration_1109",
    "duration_1110",
    "duration_1111",
    "duration_1112",
    "duration_1113",
    "duration_1114",
    "duration_1115",
    "duration_1116",
    "duration_1117",
    "duration_1118",
    "duration_1119",
    "duration_1120",
    "duration_1121",
    "duration_1122",
    "duration_1123",
    "duration_1124",
    "duration_1125",
    "duration_1126",
    "duration_1127",
    "duration_1128",
    "duration_1129",
    "duration_1130",
    "duration_1131",
    "duration_1132",
    "duration_1133",
    "duration_1134",
    "duration_1135",
    "duration_1136",
    "duration_1137",
    "duration_1138",
    "duration_1139",
    "duration_1140",
    "duration_1141",
    "duration_1142",
    "duration_1143",
    "duration_1144",
    "duration_1145",
    "duration_1146",
    "duration_1147",
    "duration_1148",
    "duration_1149",
    "duration_1150",
    "duration_1151",
    "duration_1152",
    "duration_1153",
    "duration_1154",
    "duration_1155",
    "duration_1156",
    "duration_1157",
    "duration_1158",
    "duration_1159",
    "duration_1160",
    "duration_1161",
    "duration_1162",
    "duration_1163",
    "duration_1164",
    "duration_1165",
    "duration_1166",
    "duration_1167",
    "duration_1168",
    "duration_1169",
    "duration_1170",
    "duration_1171",
    "duration_1172",
    "duration_1173",
    "duration_1174",
    "duration_1175",
    "duration_1176",
    "duration_1177",
    "duration_1178",
    "duration_1179",
    "duration_1180",
    "duration_1181",
    "duration_1182",
    "duration_1183",
    "duration_1184",
    "duration_1185",
    "duration_1186",
    "duration_1187",
    "duration_1188",
    "duration_1189",
    "duration_1190",
    "duration_1191",
    "duration_1192",
    "duration_1193",
    "duration_1194",
    "duration_1195",
    "duration_1196",
    "duration_1197",
    "duration_1198",
    "duration_1199",
    "duration_1200",
    "duration_1201",
    "duration_1202",
    "duration_1203",
    "duration_1204",
    "duration_1205",
    "duration_1206",
    "duration_1207",
    "duration_1208",
    "duration_1209",
    "duration_1210",
    "duration_1211",
    "duration_1212",
    "duration_1213",
    "duration_1214",
    "duration_1215",
    "duration_1216",
    "duration_1217",
    "duration_1218",
    "duration_1219",
    "duration_1220",
    "duration_1221",
    "duration_1222",
    "duration_1223",
    "duration_1224",
    "duration_1225",
    "duration_1226",
    "duration_1227",
    "duration_1228",
    "duration_1229",
    "duration_1230",
    "duration_1231",
    "duration_1232",
    "duration_1233",
    "duration_1234",
    "duration_1235",
    "duration_1236",
    "duration_1237",
    "duration_1238",
    "duration_1239",
    "duration_1240",
    "duration_1241",
    "duration_1242",
    "duration_1243",
    "duration_1244",
    "duration_1245",
    "duration_1246",
    "duration_1247",
    "duration_1248",
    "duration_1249",
    "duration_1250",
    "duration_1251",
    "duration_1252",
    "duration_1253",
    "duration_1254",
    "duration_1255",
    "duration_1256",
    "duration_1257",
    "duration_1258",
    "duration_1259",
    "duration_1260",
    "duration_1261",
    "duration_1262",
    "duration_1263",
    "duration_1264",
    "duration_1265",
    "duration_1266",
    "duration_1267",
    "duration_1268",
    "duration_1269",
    "duration_1270",
    "duration_1271",
    "duration_1272",
    "duration_1273",
    "duration_1274",
    "duration_1275",
    "duration_1276",
    "duration_1277",
    "duration_1278",
    "duration_1279",
    "duration_1280",
    "duration_1281",
    "duration_1282",
    "duration_1283",
    "duration_1284",
    "duration_1285",
    "duration_1286",
    "duration_1287",
    "duration_1288",
    "duration_1289",
    "duration_1290",
    "duration_1291",
    "duration_1292",
    "duration_1293",
    "duration_1294",
    "duration_1295",
    "duration_1296",
    "duration_1297",
    "duration_1298",
    "duration_1299",
    "duration_1300",
    "duration_1301",
    "duration_1302",
    "duration_1303",
    "duration_1304",
    "duration_1305",
    "duration_1306",
    "duration_1307",
    "duration_1308",
    "duration_1309",
    "duration_1310",
    "duration_1311",
    "duration_1312",
    "duration_1313",
    "duration_1314",
    "duration_1315",
    "duration_1316",
    "duration_1317",
    "duration_1318",
    "duration_1319",
    "duration_1320",
    "duration_1321",
    "duration_1322",
    "duration_1323",
    "duration_1324",
    "duration_1325",
    "duration_1326",
    "duration_1327",
    "duration_1328",
    "duration_1329",
    "duration_1330",
    "duration_1331",
    "duration_1332",
    "duration_1333",
    "duration_1334",
    "duration_1335",
    "duration_1336",
    "duration_1337",
    "duration_1338",
    "duration_1339",
    "duration_1340",
    "duration_1341",
    "duration_1342",
    "duration_1343",
    "duration_1344",
    "duration_1345",
    "duration_1346",
    "duration_1347",
    "duration_1348",
    "duration_1349",
    "duration_1350",
    "duration_1351",
    "duration_1352",
    "duration_1353",
    "duration_1354",
    "duration_1355",
    "duration_1356",
    "duration_1357",
    "duration_1358",
    "duration_1359",
    "duration_1360",
    "duration_1361",
    "duration_1362",
    "duration_1363",
    "duration_1364",
    "duration_1365",
    "duration_1366",
    "duration_1367",
    "duration_1368",
    "duration_1369",
    "duration_1370",
    "duration_1371",
    "duration_1372",
    "duration_1373",
    "duration_1374",
    "duration_1375",
    "duration_1376",
    "duration_1377",
    "duration_1378",
    "duration_1379",
    "duration_1380",
    "duration_1381",
    "duration_1382",
    "duration_1383",
    "duration_1384",
    "duration_1385",
    "duration_1386",
    "duration_1387",
    "duration_1388",
    "duration_1389",
    "duration_1390",
    "duration_1391",
    "duration_1392",
    "duration_1393",
    "duration_1394",
    "duration_1395",
    "duration_1396",
    "duration_1397",
    "duration_1398",
    "duration_1399",
    "duration_1400",
    "duration_1401",
    "duration_1402",
    "duration_1403",
    "duration_1404",
    "duration_1405",
    "duration_1406",
    "duration_1407",
    "duration_1408",
    "duration_1409",
    "duration_1410",
    "duration_1411",
    "duration_1412",
    "duration_1413",
    "duration_1414",
    "duration_1415",
    "duration_1416",
    "duration_1417",
    "duration_1418",
    "duration_1419",
    "duration_1420",
    "duration_1421",
    "duration_1422",
    "duration_1423",
    "duration_1424",
    "duration_1425",
    "duration_1426",
    "duration_1427",
    "duration_1428",
    "duration_1429",
    "duration_1430",
    "duration_1431",
    "duration_1432",
    "duration_1433",
    "duration_1434",
    "duration_1435",
    "duration_1436",
    "duration_1437",
    "duration_1438",
    "duration_1439",
    "duration_1440",
    "duration_1441",
    "duration_1442",
    "duration_1443",
    "duration_1444",
    "duration_1445",
    "duration_1446",
    "duration_1447",
    "duration_1448",
    "duration_1449",
    "duration_1450",
    "duration_1451",
    "duration_1452",
    "duration_1453",
    "duration_1454",
    "duration_1455",
    "duration_1456",
    "duration_1457",
    "duration_1458",
    "duration_1459",
    "duration_1460",
    "duration_1461",
    "duration_1462",
    "duration_1463",
    "duration_1464",
    "duration_1465",
    "duration_1466",
    "duration_1467",
    "duration_1468",
    "duration_1469",
    "duration_1470",
    "duration_1471",
    "duration_1472",
    "duration_1473",
    "duration_1474",
    "duration_1475",
    "duration_1476",
    "duration_1477",
    "duration_1478",
    "duration_1479",
    "duration_1480",
    "duration_1481",
    "duration_1482",
    "duration_1483",
    "duration_1484",
    "duration_1485",
    "duration_1486",
    "duration_1487",
    "duration_1488",
    "duration_1489",
    "duration_1490",
    "duration_1491",
    "duration_1492",
    "duration_1493",
    "duration_1494",
    "duration_1495",
    "duration_1496",
    "duration_1497",
    "duration_1498",
    "duration_1499",
    "duration_1500",
    "duration_1501",
    "duration_1502",
    "duration_1503",
    "duration_1504",
    "duration_1505",
    "duration_1506",
    "duration_1507",
    "duration_1508",
    "duration_1509",
    "duration_1510",
    "duration_1511",
    "duration_1512",
    "duration_1513",
    "duration_1514",
    "duration_1515",
    "duration_1516",
    "duration_1517",
    "duration_1518",
    "duration_1519",
    "duration_1520",
    "duration_1521",
    "duration_1522",
    "duration_1523",
    "duration_1524",
    "duration_1525",
    "duration_1526",
    "duration_1527",
    "duration_1528",
    "duration_1529",
    "duration_1530",
    "duration_1531",
    "duration_1532",
    "duration_1533",
    "duration_1534",
    "duration_1535",
    "duration_1536",
    "duration_1537",
    "duration_1538",
    "duration_1539",
    "duration_1540",
    "duration_1541",
    "duration_1542",
    "duration_1543",
    "duration_1544",
    "duration_1545",
    "duration_1546",
    "duration_1547",
    "duration_1548",
    "duration_1549",
    "duration_1550",
    "duration_1551",
    "duration_1552",
    "duration_1553",
    "duration_1554",
    "duration_1555",
    "duration_1556",
    "duration_1557",
    "duration_1558",
    "duration_1559",
    "duration_1560",
    "duration_1561",
    "duration_1562",
    "duration_1563",
    "duration_1564",
    "duration_1565",
    "duration_1566",
    "duration_1567",
    "duration_1568",
    "duration_1569",
    "duration_1570",
    "duration_1571",
    "duration_1572",
    "duration_1573",
    "duration_1574",
    "duration_1575",
    "duration_1576",
    "duration_1577",
    "duration_1578",
    "duration_1579",
    "duration_1580",
    "duration_1581",
    "duration_1582",
    "duration_1583",
    "duration_1584",
    "duration_1585",
    "duration_1586",
    "duration_1587",
    "duration_1588",
    "duration_1589",
    "duration_1590",
    "duration_1591",
    "duration_1592",
    "duration_1593",
    "duration_1594",
    "duration_1595",
    "duration_1596",
    "duration_1597",
    "duration_1598",
    "duration_1599",
    "duration_1600",
    "duration_1601",
    "duration_1602",
    "duration_1603",
    "duration_1604",
    "duration_1605",
    "duration_1606",
    "duration_1607",
    "duration_1608",
    "duration_1609",
    "duration_1610",
    "duration_1611",
    "duration_1612",
    "duration_1613",
    "duration_1614",
    "duration_1615",
    "duration_1616",
    "duration_1617",
    "duration_1618",
    "duration_1619",
    "duration_1620",
    "duration_1621",
    "duration_1622",
    "duration_1623",
    "duration_1624",
    "duration_1625",
    "duration_1626",
    "duration_1627",
    "duration_1628",
    "duration_1629",
    "duration_1630",
    "duration_1631",
    "duration_1632",
    "duration_1633",
    "duration_1634",
    "duration_1635",
    "duration_1636",
    "duration_1637",
    "duration_1638",
    "duration_1639",
    "duration_1640",
    "duration_1641",
    "duration_1642",
    "duration_1643",
    "duration_1644",
    "duration_1645",
    "duration_1646",
    "duration_1647",
    "duration_1648",
    "duration_1649",
    "duration_1650",
    "duration_1651",
    "duration_1652",
    "duration_1653",
    "duration_1654",
    "duration_1655",
    "duration_1656",
    "duration_1657",
    "duration_1658",
    "duration_1659",
    "duration_1660",
    "duration_1661",
    "duration_1662",
    "duration_1663",
    "duration_1664",
    "duration_1665",
    "duration_1666",
    "duration_1667",
    "duration_1668",
    "duration_1669",
    "duration_1670",
    "duration_1671",
    "duration_1672",
    "duration_1673",
    "duration_1674",
    "duration_1675",
    "duration_1676",
    "duration_1677",
    "duration_1678",
    "duration_1679",
    "duration_1680",
    "duration_1681",
    "duration_1682",
    "duration_1683",
    "duration_1684",
    "duration_1685",
    "duration_1686",
    "duration_1687",
    "duration_1688",
    "duration_1689",
    "duration_1690",
    "duration_1691",
    "duration_1692",
    "duration_1693",
    "duration_1694",
    "duration_1695",
    "duration_1696",
    "duration_1697",
    "duration_1698",
    "duration_1699",
    "duration_1700",
    "duration_1701",
    "duration_1702",
    "duration_1703",
    "duration_1704",
    "duration_1705",
    "duration_1706",
    "duration_1707",
    "duration_1708",
    "duration_1709",
    "duration_1710",
    "duration_1711",
    "duration_1712",
    "duration_1713",
    "duration_1714",
    "duration_1715",
    "duration_1716",
    "duration_1717",
    "duration_1718",
    "duration_1719",
    "duration_1720",
    "duration_1721",
    "duration_1722",
    "duration_1723",
    "duration_1724",
    "duration_1725",
    "duration_1726",
    "duration_1727",
    "duration_1728",
    "duration_1729",
    "duration_1730",
    "duration_1731",
    "duration_1732",
    "duration_1733",
    "duration_1734",
    "duration_1735",
    "duration_1736",
    "duration_1737",
    "duration_1738",
    "duration_1739",
    "duration_1740",
    "duration_1741",
    "duration_1742",
    "duration_1743",
    "duration_1744",
    "duration_1745",
    "duration_1746",
    "duration_1747",
    "duration_1748",
    "duration_1749",
    "duration_1750",
    "duration_1751",
    "duration_1752",
    "duration_1753",
    "duration_1754",
    "duration_1755",
    "duration_1756",
    "duration_1757",
    "duration_1758",
    "duration_1759",
    "duration_1760",
    "duration_1761",
    "duration_1762",
    "duration_1763",
    "duration_1764",
    "duration_1765",
    "duration_1766",
    "duration_1767",
    "duration_1768",
    "duration_1769",
    "duration_1770",
    "duration_1771",
    "duration_1772",
    "duration_1773",
    "duration_1774",
    "duration_1775",
    "duration_1776",
    "duration_1777",
    "duration_1778",
    "duration_1779",
    "duration_1780",
    "duration_1781",
    "duration_1782",
    "duration_1783",
    "duration_1784",
    "duration_1785",
    "duration_1786",
    "duration_1787",
    "duration_1788",
    "duration_1789",
    "duration_1790",
    "duration_1791",
    "duration_1792",
    "duration_1793",
    "duration_1794",
    "duration_1795",
    "duration_1796",
    "duration_1797",
    "duration_1798",
    "duration_1799",
    "duration_1800",
    "duration_1801",
    "duration_1802",
    "duration_1803",
    "duration_1804",
    "duration_1805",
    "duration_1806",
    "duration_1807",
    "duration_1808",
    "duration_1809",
    "duration_1810",
    "duration_1811",
    "duration_1812",
    "duration_1813",
    "duration_1814",
    "duration_1815",
    "duration_1816",
    "duration_1817",
    "duration_1818",
    "duration_1819",
    "duration_1820",
    "duration_1821",
    "duration_1822",
    "duration_1823",
    "duration_1824",
    "duration_1825",
    "duration_1826",
    "duration_1827",
    "duration_1828",
    "duration_1829",
    "duration_1830",
    "duration_1831",
    "duration_1832",
    "duration_1833",
    "duration_1834",
    "duration_1835",
    "duration_1836",
    "duration_1837",
    "duration_1838",
    "duration_1839",
    "duration_1840",
    "duration_1841",
    "duration_1842",
    "duration_1843",
    "duration_1844",
    "duration_1845",
    "duration_1846",
    "duration_1847",
    "duration_1848",
    "duration_1849",
    "duration_1850",
    "duration_1851",
    "duration_1852",
    "duration_1853",
    "duration_1854",
    "duration_1855",
    "duration_1856",
    "duration_1857",
    "duration_1858",
    "duration_1859",
    "duration_1860",
    "duration_1861",
    "duration_1862",
    "duration_1863",
    "duration_1864",
    "duration_1865",
    "duration_1866",
    "duration_1867",
    "duration_1868",
    "duration_1869",
    "duration_1870",
    "duration_1871",
    "duration_1872",
    "duration_1873",
    "duration_1874",
    "duration_1875",
    "duration_1876",
    "duration_1877",
    "duration_1878",
    "duration_1879",
    "duration_1880",
    "duration_1881",
    "duration_1882",
    "duration_1883",
    "duration_1884",
    "duration_1885",
    "duration_1886",
    "duration_1887",
    "duration_1888",
    "duration_1889",
    "duration_1890",
    "duration_1891",
    "duration_1892",
    "duration_1893",
    "duration_1894",
    "duration_1895",
    "duration_1896",
    "duration_1897",
    "duration_1898",
    "duration_1899",
    "duration_1900",
    "duration_1901",
    "duration_1902",
    "duration_1903",
    "duration_1904",
    "duration_1905",
    "duration_1906",
    "duration_1907",
    "duration_1908",
    "duration_1909",
    "duration_1910",
    "duration_1911",
    "duration_1912",
    "duration_1913",
    "duration_1914",
    "duration_1915",
    "duration_1916",
    "duration_1917",
    "duration_1918",
    "duration_1919",
    "duration_1920",
    "duration_1921",
    "duration_1922",
    "duration_1923",
    "duration_1924",
    "duration_1925",
    "duration_1926",
    "duration_1927",
    "duration_1928",
    "duration_1929",
    "duration_1930",
    "duration_1931",
    "duration_1932",
    "duration_1933",
    "duration_1934",
    "duration_1935",
    "duration_1936",
    "duration_1937",
    "duration_1938",
    "duration_1939",
    "duration_1940",
    "duration_1941",
    "duration_1942",
    "duration_1943",
    "duration_1944",
    "duration_1945",
    "duration_1946",
    "duration_1947",
    "duration_1948",
    "duration_1949",
    "duration_1950",
    "duration_1951",
    "duration_1952",
    "duration_1953",
    "duration_1954",
    "duration_1955",
    "duration_1956",
    "duration_1957",
    "duration_1958",
    "duration_1959",
    "duration_1960",
    "duration_1961",
    "duration_1962",
    "duration_1963",
    "duration_1964",
    "duration_1965",
    "duration_1966",
    "duration_1967",
    "duration_1968",
    "duration_1969",
    "duration_1970",
    "duration_1971",
    "duration_1972",
    "duration_1973",
    "duration_1974",
    "duration_1975",
    "duration_1976",
    "duration_1977",
    "duration_1978",
    "duration_1979",
    "duration_1980",
    "duration_1981",
    "duration_1982",
    "duration_1983",
    "duration_1984",
    "duration_1985",
    "duration_1986",
    "duration_1987",
    "duration_1988",
    "duration_1989",
    "duration_1990",
    "duration_1991",
    "duration_1992",
    "duration_1993",
    "duration_1994",
    "duration_1995",
    "duration_1996",
    "duration_1997",
    "duration_1998",
    "duration_1999",
    "duration_2000",
    "duration_2001",
    "duration_2002",
    "duration_2003",
    "duration_2004",
    "duration_2005",
    "duration_2006",
    "duration_2007",
    "duration_2008",
    "duration_2009",
    "duration_2010",
    "duration_2011",
    "duration_2012",
    "duration_2013",
    "duration_2014",
    "duration_2015",
    "duration_2016",
    "duration_2017",
    "duration_2018",
    "duration_2019",
    "duration_2020",
    "duration_2021",
    "duration_2022",
    "duration_2023",
    "duration_2024",
    "duration_2025",
    "duration_2026",
    "duration_2027",
    "duration_2028",
    "duration_2029",
    "duration_2030",
    "duration_2031",
    "duration_2032",
    "duration_2033",
    "duration_2034",
    "duration_2035",
    "duration_2036",
    "duration_2037",
    "duration_2038",
    "duration_2039",
    "duration_2040",
    "duration_2041",
    "duration_2042",
    "duration_2043",
    "duration_2044",
    "duration_2045",
    "duration_2046",
    "duration_2047",
    "duration_2048",
    "duration_2049",
    "duration_2050",
    "duration_2051",
    "duration_2052",
    "duration_2053",
    "duration_2054",
    "duration_2055",
    "duration_2056",
    "duration_2057",
    "duration_2058",
    "duration_2059",
    "duration_2060",
    "duration_2061",
    "duration_2062",
    "duration_2063",
    "duration_2064",
    "duration_2065",
    "duration_2066",
    "duration_2067",
    "duration_2068",
    "duration_2069",
    "duration_2070",
    "duration_2071",
    "duration_2072",
    "duration_2073",
    "duration_2074",
    "duration_2075",
    "duration_2076",
    "duration_2077",
    "duration_2078",
    "duration_2079",
    "duration_2080",
    "duration_2081",
    "duration_2082",
    "duration_2083",
    "duration_2084",
